---
kind: property
id: P:Autodesk.Revit.DB.Events.ExternalDataInstanceRemovingFromDocumentEventArgs.TypeId
source: html/58b38c79-648d-782f-e077-ea11e6907d95.htm
---
# Autodesk.Revit.DB.Events.ExternalDataInstanceRemovingFromDocumentEventArgs.TypeId Property

The type id of the external data instance id being removed from Revit document.

## Syntax (C#)
```csharp
public ElementId TypeId { get; }
```